"""
Patinya Sribrowornnara
19:22 4/6/2564

Exercise 5 : ปฏิบัติการพัฒนาโปรแกรมที่ใช้งานได้จริง และ ข้อมูล
2.ตั้งชื่อไฟล์ Exercise5_2_ชื่อ_ตัวอักษรแรกของนามสกุล.py

เรื่องราวของวิชาฟิสิกส์ที่เรามักเจอกันในบทเรียนแรกๆ คือสูตร v=s/t ซึ่งคือสูตรในการคำนวณหาระยะทางที่เคลื่อนที่ได้ ต่อ 1 หน่วยเวลา
v คืออัตราเร็วของการเคลื่อนที่ (m/s หรือ km/hr)
t คือเวลาที่วัตถุใช้เคลื่อนที่จริง (s หรือ hr)
เช่น ถ้าหากเราต้องการจะทราบว่ารถคันหนึ่งอัตราเร็วเท่าไหร่ เราก็นำระทางที่รถคันนั้นเคลื่อนที่ได้ (ซึ่งหน่วยอาจจะเป็นเมตร หรือ กิโลเมตรก็แล้วแต่)
นำมาหารกับ เวลาที่เคลื่อนที่นั้นเอง เหมือนที่เราพบเห็นบ่อยๆ ที่เขามักพูดกันว่า 100 กิโลเมตรต่อชั่วโมง หรือ 120 กิโลเมตรต่อชั่วโมงทำนองนั้นเลย !
ให้เราพัฒนาโปรแกรมคำนวณหาค่าอัตราเร็ว โดยให้ผู้ใช้งาน
กรอกระยะทาง โดยมีค่าตั้งแต่ 1 ขึ้นไป ลงในตัวแปร
กรอกเวลาที่เคลื่อนที่ โดยมีค่าตั้งแต่ 1 ขึ้นไป ลงในตัวแปร
พร้อมทั้งแสดงผลลัพธ์ออกมาบนหน้าจอตามตัวอย่างกรณีทดสอบด้านล่าง

ตัวอย่างรูปแบบ Output ที่แสดงผลโปรแกรม
- กรณีตัวแปรระยะทางคือ 120 และ ตัวแปรเวลาคือ 10
12 km/h

"""

distance = int(input("enter distance (km)    : ")) #ระยะทางที่วัตถุที่เคลื่อนที่     #input
time     = int(input("enter time     (hr)    : ")) #เวลาที่วัตถุใช้เคลื่อนที่       #input

speed    = int(distance/time)  #นำระยะทาง หาร กับ เวลา จะได้ตัวเลขติดทศนิยม ก่อนจะแปลงข้อมูลเป็นประเภท int        #process

""" 
เมื่อนำชนิดข้อมูลมาหารกัน ไม่ว่าจะเป็น int หรือ float ผลลัพธ์จะออกมาเป็น float (ตัวเลขทศนิยม) 
ซึ่งสามารถแปลงให้อยู่ในรูปของ integer ได้ในระหว่างที่คำนวณ โดยจะทำในวงเล็บก่อนเสมอ และนำมาแปลงเป็นประเภท int
ก่อนนำมาแสดงผลลัพธ์ที่อยู่ในหน้าจอ บรรทัดที่ 34
"""


print ("speed                  :",speed,"km/hr") #แสดงข้อความออกมาบนหน้าจอเป็นความเร็วที่วัตถุเคลื่อนที่จริง #output